# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'jacobbednarz/tap'
tap 'shivammathur/php'
tap 'shivammathur/extensions'
tap 'oven-sh/bun'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'diff-so-fancy'
brew 'duf'
brew 'eza'
brew 'ffmpeg'
brew 'fx'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'glow'
brew 'glances'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'jq'
brew 'llvm'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'procs'
brew 'ripgrep'
brew 'tldr'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Development
brew 'act'
brew 'awscli'
brew 'bun'
brew 'cf-vault'
brew 'composer'
brew 'gifsicle'
brew 'optipng'
brew 'imagemagick'
brew 'jpegoptim'
brew 'php'
brew 'python'
brew 'postgresql@16'
brew 'k9s'
brew 'minikube'
brew 'nvm'
brew 'pngquant'
brew 'rustup'
brew 'rust'
brew 'svgo'
brew 'webp'

# Apps
cask '1password'
cask 'affinity-designer'
cask 'affinity-photo'
cask 'affinity-publisher'
cask 'android-studio'
cask 'audicity'
cask 'cleanshot'
cask 'chatgpt'
cask 'dash'
cask 'discord'
cask 'elgato-stream-deck'
cask 'focusrite-control-2'
cask 'google-chrome'
cask 'google-chrome@canary'
cask 'google-cloud-sdk'
cask 'google-drive'
cask 'languagetool'
cask 'logi-options-plus'
cask 'obsidian'
cask 'orbstack'
cask 'rapidapi'
cask 'raycast'
cask 'spotify'
cask 'tableplus'
cask 'the-unarchiver'
cask 'tint'
cask 'transmit'
cask 'visual-studio-code'
cask 'vlc'
cask 'warp'
cask 'webstorm'
cask 'zoom'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-fira-code'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Amphetamine', id: 937984704
mas 'Magnet', id: 441258766
mas 'Xcode', id: 497799835
mas 'Smart Countdown Timer', id: 1410709951
mas 'WhatsApp', id: 310633997
