# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-drivers'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'shivammathur/php'
tap 'shivammathur/extensions'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'bat'
brew 'exa'
brew 'duf'
brew 'ripgrep'
brew 'diff-so-fancy'
brew 'fx'
brew 'jq'
brew 'tldr'
brew 'glances'
brew 'procs'
brew 'dog'
brew 'glow'

# Development
brew 'postegresql@14'
brew 'nvm'
brew 'imagemagick'
brew 'awscli'
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'
brew 'webp'
brew 'rustup-init'

# Apps
cask '1password'
cask 'android-studio'
cask 'cleanshot'
cask 'crossover'
cask 'dash'
cask 'dropbox'
cask 'discord'
cask 'fantastical'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'mochi'
cask 'notion'
cask 'obsidian'
cask 'orbstack'
cask 'rapidapi'
cask 'raycast'
cask 'signal'
cask 'spotify'
cask 'tableplus'
cask 'the-unarchiver'
cask 'tint'
cask 'transmit'
cask 'vlc'
cask 'visual-studio-code'
cask 'grammarly-desktop'
cask 'logi-options-plus'
cask 'warp'
cask 'zoom'


# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Amphetamine', id: 937984704
mas 'Magnet', id: 441258766
mas 'Reeder 5', id: 1529448980
mas 'Endel', id: 1484348796
mas 'Xcode', id: 497799835
mas 'Flow', id: 1423210932
mas 'Smart Countdown Timer', id: 1410709951
